docs/posts/2017-05-04-thoughts-on-the-johnson-amendment.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- Dec 10, 2024 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Thoughts on Trump and the Johnson Amendment</title>
<meta name="author" content="Randy Ridenour" />
<meta name="generator" content="Org Mode" />
<link rel='icon' type='image/x-icon' href='/images/favicon.ico'/>
<meta name='viewport' content='width=device-width, initial-scale=1'>
<link rel='stylesheet' href='/css/neat.css' type='text/css'/>
<link rel='stylesheet' href='/css/custom.css' type='text/css'/>
<link rel='stylesheet' href='/css/syntax-coloring.css' type='text/css'/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="/"> UP </a>
 |
 <a accesskey="H" href="/"> HOME </a>
</div><header id="top" class="status">
<div class="banner">
  <h2><a href="/">Randy Ridenour</a></h2>
  <nav class="navbar">
    <ul>
      <li><a href="/posts/">Blog</a></li>
      <li><a href="/about.html">About</a></li>
      <li><a href="/index.xml">RSS</a></li>
    </ul>
  </nav>
</div>
</header>
<main id="content" class="content">
<header>
<h1 class="title">Thoughts on Trump and the Johnson Amendment</h1>
<p class="subtitle" role="doc-subtitle">May 04, 2017</p>
</header><p>
Some thoughts on President Trump&rsquo;s Executive Order on &ldquo;Promoting  Free Speech and Religious Liberty&rdquo; that was recently issued:
</p>

<p>
First of all, the President&rsquo;s executive order doesn&rsquo;t change anything about religious leaders engaging in political action from the pulpit.  This is from section 2, the relevant part of the order:
</p>

<p>
&gt;The Secretary of the Treasury shall ensure, to the extent permitted by law, that the Department of the Treasury does not take any adverse action against any individual, house of worship, or other religious organization on the basis that such individual or organization speaks or has spoken about moral or political issues from a religious perspective, where speech of similar character has, consistent with law, not ordinarily been treated as participation or intervention in a political campaign on behalf of (or in opposition to) a candidate for public office by the Department of the Treasury.
</p>

<p>
All it says is that speech that has so far been considered consistent with the law should continue to be considered consistent with the law. Nothing changes, so foes of the Johnson Amendment should be severely disappointed. It is, like much of what seems to be coming from Washington these days, Shakespearean: &ldquo;full of sound and fury, signifying nothing.&rdquo;
</p>

<p>
Given recent discussions, it appears that the current law is severely misunderstood by many. Most political activity by churches is, and has always been, completely legal. Churches and leaders have always been allowed to speak on issues, legislation, and most matters of political concern. What pastors are not allowed to do is to campaign, in their role as pastors, for candidates. That is, they are to refrain from partisan campaigning in exchange for the tax-exempt status of their churches.
</p>

<p>
Regardless of Johnson&rsquo;s motivation for desiring this (which, knowing Johnson, was likely not altogether virtuous), it is a good thing. Granting tax-exempt status is subsidizing religious activity – churches, synagogues, and even mosques get services from the city for which they pay nothing, services like police and fire protection. For these free services, only one accommodation is required, that is to refrain from campaigning for candidates. 
</p>

<p>
The law in no way restricts the free speech rights of anyone. Churches are always welcome to give up their tax-exempt status. Churches should just not expect citizens to pay for their campaigning by means of that tax-exempt status. If the current law is changed, then note that citizens will be subsidizing, through the taxes which pay for police, fire departments, etc., the political campaigns of candidates that they do not support.
</p>
</main>
<footer id="postamble" class="status">
<div class='footer'>
  Copyright © 2024 <a href='mailto:rlridenour@fastmail.com'>Randy Ridenour.</a><br>
  Last updated on Dec 10, 2024. Generated using <a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.4 (<a href="https://orgmode.org">Org</a> mode 9.8-pre).
</div>
</footer>
</body>
</html>
